{
    "Volume 1": {
        "Subject 1": {
            "Basic": {
                "1": {
                    "img": "/images/svg/waveform_time_domain.svg",
                    "expl": "Audio vs Sound: Think of a live vocalist. Their voice is 'Sound' (air pressure). The signal flowing through the XLR cable to the mixer is 'Audio' (electricity)."
                },
                "2": {
                    "img": "/images/diagram_frequency_v2.png",
                    "expl": "Hertz (Hz): Imagine a drummer hitting 100 beats per second—that would be a low hum at 100Hz. Frequency is just the speed of vibration."
                },
                "3": {
                    "img": "/images/svg/pitch_vs_frequency.svg",
                    "expl": "Pitch is perception. A 440Hz vibration is physics; we hear it as the musical note 'A4' (Middle A), the standard tuning reference for orchestras."
                },
                "4": {
                    "img": "/images/svg/amplitude_loudness.svg",
                    "expl": "Amplitude is energy. Plucking a guitar string harder creates a larger physical vibration (amplitude), which we hear as a louder volume."
                },
                "5": {
                    "img": "/images/diagram_fletcher_munson_v2.png",
                    "expl": "20Hz-20kHz: From the lowest sub-bass rumble of an 808 kick (30-60Hz) to the highest air of a vocal reverb (15kHz+), this is our musical canvas."
                },
                "6": {
                    "img": "/images/svg/waveform_time_domain.svg",
                    "expl": "Waveform: The visual 'shape' of sound. A smooth curve is a flute; a jagged, spiky line is a distorted guitar. We edit audio by looking at these shapes."
                },
                "7": {
                    "img": "/images/svg/dbfs_meter.svg",
                    "expl": "Decibels (dB): Our ears are logarithmic. To make a sound feel 'twice as loud', we need 10 times the power. That's why a 100W amp isn't 10x louder than a 10W amp."
                },
                "8": {
                    "img": "/images/svg/waveform_time_domain.svg",
                    "expl": "Transients: The initial 'crack' of a drum hit. In modern pop, we preserve these at all costs to keep the track punchy and rhythmic."
                },
                "9": {
                    "img": "/images/svg/frequency_spectrum_bass.svg",
                    "expl": "Bass (20-250Hz): The foundation. In a club, this is the frequency range that physically moves your chest. Without it, music feels thin and weak."
                },
                "10": {
                    "img": "/images/svg/frequency_spectrum_treble.svg",
                    "expl": "Treble (4kHz+): The detail. This is where the 'air' lives. It defines the expensive sheen of a pop vocal or the shimmer of a cymbal."
                }
            },
            "Intermediate": {
                "1": {
                    "img": "/images/diagram_frequency_v2.png",
                    "expl": "Wavelength: A 100Hz wave is 3.4 meters long. This is why bass traps in studios need to be huge—to catch these massive physical waves."
                },
                "2": {
                    "img": "/images/svg/waveform_time_domain.svg",
                    "expl": "Timbre: The 'fingerprint' of sound. It's the difference between a Stradivarius violin and a cheap fiddle playing the same note. It comes from harmonics."
                },
                "3": {
                    "img": "/images/svg/phase_cancellation.svg",
                    "expl": "Phase Cancellation: The silent enemy. If your top snare mic pushes the speaker out, and the bottom mic pulls it in, they cancel each other out. Thin sound results."
                },
                "4": {
                    "img": "/images/diagram_frequency_v2.png",
                    "expl": "Harmonics: The 'flavor' ingredients. A pure sine wave has no harmonics (bland). A distorted guitar has thousands of harmonics (spicy/rich)."
                },
                "5": {
                    "img": "/images/svg/dynamic_range_concept.svg",
                    "expl": "Peak-to-Average Ratio: Drums have high peaks (spikes). Synths have low peaks (blocks). Mastering engineers manage this ratio to make tracks loud."
                },
                "6": {
                    "img": "/images/diagram_phase_v2.png",
                    "expl": "Phase Degrees: 180° is a complete flip (polarity inversion). 90° is 'out of phase' but not silent—it just sounds weird and hollow."
                },
                "7": {
                    "img": "/images/diagram_frequency_v2.png",
                    "expl": "Wavelength vs Freq: High frequencies are tiny (cm). Low frequencies are huge (meters). You can block treble with a curtain, but bass goes right through concrete."
                },
                "8": {
                    "img": "/images/diagram_phase_v2.png",
                    "expl": "Constructive Interference: When waves align, they boost each other. This is how line-array speakers at festivals throw sound over huge distances."
                },
                "9": {
                    "img": "/images/svg/waveform_time_domain.svg",
                    "expl": "Square Wave: The sound of 8-bit Nintendo. It sounds 'hollow' because it contains only odd harmonics (1, 3, 5, 7...). Ideally suited for bass synths."
                },
                "10": {
                    "img": "/images/diagram_fletcher_munson_v2.png",
                    "expl": "Fletcher-Munson: We evolved to hear baby cries (3kHz). So a 3kHz guitar solo sounds 'louder' than a bass line at the same actual volume."
                }
            }
        },
        "Subject 2": {
            "Basic": {
                "1": {
                    "img": "/images/svg/dbfs_meter.svg",
                    "expl": "Decibels are relative. Saying '10dB' is like saying 'bigger'. Bigger than what? You always need a reference level (like 0dB or SPL)."
                },
                "2": {
                    "img": "/images/svg/dynamic_range_concept.svg",
                    "expl": "Dynamic Range: The gap between the noise floor (hiss) and distortion. In classical music, this gap is huge. In dubstep, it's tiny."
                },
                "3": {
                    "img": "/images/diagram_clipping_v2.png",
                    "expl": "Clipping: When the wave hits the ceiling. In digital, it sounds like a nasty 'crack'. It breaks the illusion of reality instantly."
                },
                "4": {
                    "img": "/images/svg/snr_concept.svg",
                    "expl": "Noise Floor: The 'silence' of a studio isn't truly silent. There's always preamble hiss, air conditioning, and electrical buzz. We record above this 'floor'."
                },
                "5": {
                    "img": "/images/svg/dbfs_meter.svg",
                    "expl": "0dBFS: The absolute limit of digital audio. Unlike analog tape which can be pushed into the red for warmth, digital just uglies up."
                },
                "6": {
                    "img": "/images/svg/headroom_diagram.svg",
                    "expl": "Headroom: The safety zone. If you record at -12dB, you leave room for the drummer to get excited and hit louder without ruining the take."
                },
                "7": {
                    "img": "/images/svg/amplitude_loudness.svg",
                    "expl": "Inverse Square Law: Move the mic 2x further back, lose -6dB of volume. This is why close-micing is so powerful for isolation."
                },
                "8": {
                    "img": "/images/svg/dbfs_meter.svg",
                    "expl": "SPL (Sound Pressure Level): The physical loudness in the room. 85dB SPL is a safe mixing level. 120dB SPL damages your ears quickly."
                },
                "9": {
                    "img": "/images/svg/snr_concept.svg",
                    "expl": "Signal-to-Noise: We want high Signal (Music) and low Noise (Hiss). A ratio of 100dB is pro quality. Old cassettes had only 50dB (lots of hiss)."
                },
                "10": {
                    "img": "/images/diagram_fletcher_munson_v2.png",
                    "expl": "Bass perception: At low volumes, bass disappears. This is why we mix at a consistent volume—to stop us from over-boosting the bass."
                }
            },
            "Intermediate": {
                "1": {
                    "img": "/images/svg/dbfs_meter.svg",
                    "expl": "Power Doubling: +3dB. It takes double the amplifier watts to get just +3dB of volume. To get +10dB (perceived double volume), you need 10x the watts!"
                },
                "2": {
                    "img": "/images/svg/dynamic_range_concept.svg",
                    "expl": "24-bit Dynamic Range: 144dB. This is so huge it exceeds the physics of air. It allows us to record very quiet sounds without hiss."
                },
                "3": {
                    "img": "/images/svg/dbfs_meter.svg",
                    "expl": "120dB Threshold of Pain: When sound becomes physical pain. A snare drum rimshot at 1 inch is often 140dB SPL!"
                },
                "4": {
                    "img": "/images/svg/snr_concept.svg",
                    "expl": "Gain Staging: Keeping the signal clean at every step. distortion is cumulative—a little bit at the preamp + a little at the EQ = a messy mix."
                },
                "5": {
                    "img": "/images/diagram_clipping_v2.png",
                    "expl": "Square Wave Distortion: Hard clipping chops the round tops off a wave, turning it square. This creates harsh, odd harmonics that fatigue the ear."
                },
                "6": {
                    "img": "/images/svg/amplitude_loudness.svg",
                    "expl": "Distance & Intimacy: Close mics sound 'intimate' because they lack room reverb. Distant mics sound 'documentary' because of the Inverse Square Law."
                },
                "7": {
                    "img": "/images/svg/headroom_diagram.svg",
                    "expl": "RMS vs Peak: Peaky signals (percussion) act differently than RMS signals (pads/bass). Your compressor reacts to Peaks, but your ear hears RMS."
                },
                "8": {
                    "img": "/images/diagram_fletcher_munson_v2.png",
                    "expl": "dBA vs dBC: dBA weighting ignores bass (like human ears). Use this for safety checks. dBC includes bass—use this for checking subwoofer levels."
                },
                "9": {
                    "img": "/images/svg/dbfs_meter.svg",
                    "expl": "Decibel Typology: dBFS is digital. dBu is voltage. dB SPL is acoustic pressure. Never compare them directly without conversion."
                },
                "10": {
                    "img": "/images/svg/dynamic_range_concept.svg",
                    "expl": "Quantization Noise Floor: At 16-bit (-96dB), you might hear the noise floor in a silent classical break. At 24-bit (-144dB), it is theoretically impossible to hear."
                }
            }
        },
        "Subject 3": {
            "Basic": {
                "1": {
                    "img": "/images/svg/sample_rate_dots.svg",
                    "expl": "Sample Rate: Think of a flip-book animation. More pages = smoother motion. 44,100 samples per second is the smoothness needed for flawless audio."
                },
                "2": {
                    "img": "/images/diagram_nyquist_v2.png",
                    "expl": "Nyquist Rule: You must sample twice as fast as the highest pitch you want to capture. To catch 20kHz, we need 40kHz+ speed."
                },
                "3": {
                    "img": "/images/svg/quantization_steps.svg",
                    "expl": "Bit Depth: The 'vertical' resolution. 8-bit is grainy (Nintendo). 16-bit is clean (CD). 24-bit is pristine (Studio)."
                },
                "4": {
                    "img": "/images/diagram_cd_specs_v2.png",
                    "expl": "CD Standard: 16-bit / 44.1kHz. Chosen in 1980 to fit Beethoven's 9th Symphony on a single disc. It remains the reference quality today."
                },
                "5": {
                    "img": "/images/diagram_aliasing_v2.png",
                    "expl": "Aliasing: An error where high frequencies fold back as ugly noise. It's why old samplers sounded 'crunchy'—they had bad anti-aliasing filters."
                },
                "6": {
                    "img": "/images/diagram_file_size_math_v2.png",
                    "expl": "MP3 Compression: Psychoacoustics in action. The MP3 algorithm says 'You can't hear this quiet sound after that loud cymbal crash', so it deletes it."
                },
                "7": {
                    "img": "/images/svg/quantization_steps.svg",
                    "expl": "Quantization Error: The difference between the real smooth wave and the stepped digital version. It manifests as a low-level grit or fuzz."
                },
                "8": {
                    "img": "/images/diagram_jitter_clock_v2.png",
                    "expl": "Jitter: Digital timing errors. If the clock isn't steady, the audio blurs. Like a drummer with shaky timing."
                },
                "9": {
                    "img": "/images/svg/dither_concept.svg",
                    "expl": "Dither: Mathematical noise. We add a tiny hiss to mask the ugly quantization distortion. It makes digital fade-outs sound smooth instead of glitchy."
                },
                "10": {
                    "img": "/images/diagram_latency_buffer_v2.png",
                    "expl": "Latency: The echo caused by computer processing time. Lowering the buffer size reduces latency but works the CPU harder."
                }
            },
            "Intermediate": {
                "1": {
                    "img": "/images/diagram_nyquist_v2.png",
                    "expl": "Nyquist Frequency: The theoretical limit. At 48kHz sample rate, the Nyquist limit is 24kHz. Nothing above 24kHz can be recorded."
                },
                "2": {
                    "img": "/images/diagram_file_size_math_v2.png",
                    "expl": "Bitrate: CD is 1411 kbps. Spotify High Quality is 320 kbps. We throw away 75% of the data, yet it sounds remarkably close."
                },
                "3": {
                    "img": "/images/svg/quantization_steps.svg",
                    "expl": "SQNR (Signal Quantization Noise Ratio): Each bit adds 6dB of range. 16 bits * 6 = 96dB. 24 bits * 6 = 144dB."
                },
                "4": {
                    "img": "/images/diagram_aliasing_v2.png",
                    "expl": "Brickwall Filter: The analog filter before modulation. It ruthlessly cuts everything above 20kHz to prevent aliasing, but can cause phase shifts."
                },
                "5": {
                    "img": "/images/diagram_jitter_clock_v2.png",
                    "expl": "Word Clock Dist: BNC cables carry the sync pulse. In a complex studio, one Master Clock (like an Antelope Trinity) keeps all converters in perfect step."
                },
                "6": {
                    "img": "/images/svg/sample_rate_dots.svg",
                    "expl": "Oversampling: Processing at 4x sample rate (176kHz) allows plugins to saturate and compress without producing digital aliasing artifacts."
                },
                "7": {
                    "img": "/images/diagram_file_size_math_v2.png",
                    "expl": "Lossless Compression: FLAC/ALAC works like ZIP. It finds patterns (redundancy) to shrink the file, but reconstructs it pixel-perfectly on playback."
                },
                "8": {
                    "img": "/images/svg/dither_concept.svg",
                    "expl": "Truncation Distortion: Cutting 24-bit to 16-bit without dither creates nasty harmonic distortion at low levels. Dither fixes this by randomizing the error."
                },
                "9": {
                    "img": "/images/diagram_latency_buffer_v2.png",
                    "expl": "Round Trip Latency: Input Processing + Output Processing + Converter Latency. A '4ms' buffer might actually result in 10ms round-trip delay."
                },
                "10": {
                    "img": "/images/diagram_file_size_math_v2.png",
                    "expl": "Shannon-Nyquist Theorem: The math proving that perfect reconstruction is possible. A sampled sine wave is not 'steps', it mathematically IS the curve once filtered."
                }
            }
        },
        "Subject 4": {
            "Basic": {
                "1": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Chain: Microphones create tiny voltages. Preamps make them big. Converters make them digital. Computers record them. Learn this flow!"
                },
                "2": {
                    "img": "/images/svg/transducer_diagram.svg",
                    "expl": "Transducers: The ears and mouth of the system. Mics (ears) and Speakers (mouths) are the only parts that actually move air."
                },
                "3": {
                    "img": "/images/svg/equipment_di_box_function.svg",
                    "expl": "DI Box: Essential for Bass Guitar. It changes the instrument's high-impedance signal into a mic-friendly signal so you can plug it into a stage snake."
                },
                "4": {
                    "img": "/images/svg/equipment_cable_types_connector_guide.svg",
                    "expl": "XLR: The 3-pin Lock. It carries Balanced Audio (hot, cold, ground). It's designed to be rugged and stepped on at gigs."
                },
                "5": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Mic vs Line: Mic signals are fragile and quiet. Line signals are robust and loud. Plugging a synth (Line) into a Mic input will distort horribly."
                },
                "6": {
                    "img": "/images/svg/equipment_di_box_function.svg",
                    "expl": "Balanced Cables: Magic noise cancellation. They flip the signal phase on one wire, transmit it, then flip it back at the end, deleting any buzz picked up along the way."
                },
                "7": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Phantom Power: +48V electricity sent UP the mic cable to power the circuitry in condenser mics. Dynamic mics (SM58) just ignore it."
                },
                "8": {
                    "img": "/images/diagram_spdif_connectors_v2.png",
                    "expl": "ADAT Lightpipe: That square optical port on your interface? It lets you add 8 more mic preamps via a single fiber-optic cable."
                },
                "9": {
                    "img": "/images/diagram_di_box_flow_v2.png",
                    "expl": "Hi-Z Input: The 'Instrument' jack. If you plug a guitar into a regular Line input, it sounds dull and muddy. Hi-Z acts like a guitar amp input."
                },
                "10": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Patchbay: The switchboard. Instead of crawling behind the rack to change cables, you use short patch cords on the front panel."
                }
            },
            "Intermediate": {
                "1": {
                    "img": "/images/diagram_di_box_flow_v2.png",
                    "expl": "Impedance (Z): Measured in Ohms. Mics are Low-Z (~150Ω). Guitars are Hi-Z (~10,000Ω). Mismatching causes 'loading' which kills high-end frequencies."
                },
                "2": {
                    "img": "/images/svg/equipment_di_box_function.svg",
                    "expl": "CMRR (Common Mode Rejection Ratio): The ability of a balanced input to reject noise. A high CMRR means clearer audio even in noisy electrical environments."
                },
                "3": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Insert Points: A Y-cable jack on a console. It lets you send audio OUT to a compressor and bring it back IN on a single cable."
                },
                "4": {
                    "img": "/images/diagram_spdif_connectors_v2.png",
                    "expl": "S/PDIF: Consumer digital stereo. Uses RCA cables. Be careful—it looks like analog RCA but carries digital data."
                },
                "5": {
                    "img": "/images/diagram_di_box_flow_v2.png",
                    "expl": "Direct Monitoring: Splitting the signal at the interface to hear yourself with zero latency, bypassing the computer's buffer entirely."
                },
                "6": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Aux vs Bus: An Aux extracts a copy (for reverb). A Bus groups signals together (like a Drum Bus) to be processed as one."
                },
                "7": {
                    "img": "/images/diagram_spdif_connectors_v2.png",
                    "expl": "BNC Word Clock: It's 75-ohm coaxial cable. In complex digital setups, daisy-chaining BNC ensures every converter samples at the exact same instant."
                },
                "8": {
                    "img": "/images/svg/equipment_cable_types_connector_guide.svg",
                    "expl": "TRS Applications: TRS can be Balanced Mono (Line interconnect) OR Unbalanced Stereo (Headphones). The cable looks the same, but the usage differs!"
                },
                "9": {
                    "img": "/images/diagram_di_box_flow_v2.png",
                    "expl": "Ground Loops: That annoying 50Hz/60Hz hum. Usually caused by gear being plugged into different wall outlets with different ground potentials."
                },
                "10": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Pre/Post Fader Sends: Reverb sends are 'Post' (volume dependent). Monitor mixes are 'Pre' (independent of the fader move)."
                }
            }
        },
        "Subject 5": {
            "Basic": {
                "1": {
                    "img": "/images/svg/snr_concept.svg",
                    "expl": "Gain Staging: The art of levels. Aim for the 'Goldilocks zone'—hot enough to be clean, but not so hot that you distort or clip."
                },
                "2": {
                    "img": "/images/svg/snr_concept.svg",
                    "expl": "Unity Gain (0 U): The sweet spot on a fader. It means 'Input = Output'. Your gear sounds best and has the most resolution here."
                },
                "3": {
                    "img": "/images/diagram_clipping_v2.png",
                    "expl": "Red Lights: The enemy. In digital recording, a red clip light means data loss. Back off the preamp gain until the light stays green/yellow."
                },
                "4": {
                    "img": "/images/svg/headroom_diagram.svg",
                    "expl": "-18dBFS: The new 'Zero'. Modern digital plugins are designed to sound best when the average level bumps around -18dBFS, not 0dBFS."
                },
                "5": {
                    "img": "/images/svg/snr_concept.svg",
                    "expl": "Volume vs Gain: Gain happens at the START (Preamp sensitivity). Volume happens at the END (Fader/Amp output). Turn up gain for tone, volume for loudness."
                },
                "6": {
                    "img": "/images/svg/snr_concept.svg",
                    "expl": "Monitoring Volume: Don't mix loudly! Your ears compress sound at high volumes, fooling you into thinking the bass is massive when it isn't."
                },
                "7": {
                    "img": "/images/svg/headroom_diagram.svg",
                    "expl": "PPM vs VU: PPM (Peak) meters jump fast to show clipping. VU (Volume Unit) meters move slow to show perceived loudness/energy."
                },
                "8": {
                    "img": "/images/svg/snr_concept.svg",
                    "expl": "Hiss Management: If you record a quiet whisper with low gain, then boost it later, you boost the hiss too. Record it hot (cleanly) at the source."
                },
                "9": {
                    "img": "/images/svg/snr_concept.svg",
                    "expl": "Fader Scale: Faders are logarithmic. Moving 1cm at the top changes volume slightly (fine control). Moving 1cm at the bottom cuts it to silence."
                },
                "10": {
                    "img": "/images/diagram_clipping_v2.png",
                    "expl": "Brickwall Limiter: The safety guard. It stops the signal from ever crossing 0dBFS. Essential on the master bus to protect speakers and ears."
                }
            },
            "Intermediate": {
                "1": {
                    "img": "/images/svg/snr_concept.svg",
                    "expl": "Gain Staging: The cumulative effect. If every track is 1dB too hot, the master bus will be +20dB overloaded. Start conservative."
                },
                "2": {
                    "img": "/images/svg/headroom_diagram.svg",
                    "expl": "K-System Metering: A standard that recalibrates your meters so '0' is actually -20dBFS or -14dBFS. It forces you to mix with dynamic range."
                },
                "3": {
                    "img": "/images/diagram_clipping_v2.png",
                    "expl": "Inter-sample Peaks: Hidden clipping. A digital signal might look safe, but the reconstructed analog wave can arc above the ceiling, causing distortion."
                },
                "4": {
                    "img": "/images/svg/snr_concept.svg",
                    "expl": "Analogue Emulation: Plugins like Slate or UAD mimic hardware. If you feed them a signal hotter than -18dBFS, they generate artificial distortion (saturation)."
                },
                "5": {
                    "img": "/images/svg/headroom_diagram.svg",
                    "expl": "32-bit Floating Point: The internal math of DAWs. It has near-infinite headroom. You can go +100dB over 'zero' internally without clipping, as long as you turn it down before export."
                },
                "6": {
                    "img": "/images/svg/snr_concept.svg",
                    "expl": "Calibrated SPL: Setting your speakers so -20dBFS pink noise reads 83dB SPL on a meter. This ensures your 'loud' decisions translate to other studios."
                },
                "7": {
                    "img": "/images/diagram_clipping_v2.png",
                    "expl": "True Peak: A measurement standard (EBU R128) that predicts inter-sample peaks. Streaming services demand True Peak compliance (usually -1.0dBTP)."
                },
                "8": {
                    "img": "/images/svg/snr_concept.svg",
                    "expl": "Gating for Noise: Using a Noise Gate to silence guitar amp hum when the guitarist isn't playing helps improve the overall perceived Signal-to-Noise ratio."
                },
                "9": {
                    "img": "/images/svg/snr_concept.svg",
                    "expl": "Trim/Gain Plugins: Use these as the first insert. Automate them to level out a vocal performance BEFORE it hits the compressor. This is 'Vocal Riding'."
                },
                "10": {
                    "img": "/images/svg/dbfs_meter.svg",
                    "expl": "Loudness Units (LUFS): Measures loudness over time. A jazz track with high peaks might have low LUFS. A compressed pop track has high LUFS. Streaming targets -14 LUFS."
                }
            }
        },
        "Subject 6": {
            "Basic": {
                "1": {
                    "img": "/images/diagram_mics_v2.png",
                    "expl": "Dynamic Mic: The workhorse (e.g., Shure SM58). No batteries, tough build, handles loud screams. The standard for live vocals."
                },
                "2": {
                    "img": "/images/diagram_mics_v2.png",
                    "expl": "Condenser Mic: The detailer (e.g., Rode NT1). Needs +48V Phantom Power. Captures the 'air' and breath in a voice. Studio standard."
                },
                "3": {
                    "img": "/images/diagram_mics_v2.png",
                    "expl": "Polar Pattern: The mic's listening shape. Omni hears all around (360). Cardioid hears only the front (Heart shape). Figure-8 hears front/back."
                },
                "4": {
                    "img": "/images/svg/proximity_graph.svg",
                    "expl": "Proximity Effect: Step close to a Cardioid mic, and the bass boosts. It's the 'Movie Trailer Voice' effect. Step back to thin the sound out."
                },
                "5": {
                    "img": "/images/diagram_mics_v2.png",
                    "expl": "Ribbon Mic: The warmth machine. Uses a delicate metal ribbon. It smooths out harsh guitars and brass. Very fragile—don't blow on it!"
                },
                "6": {
                    "img": "/images/diagram_mics_v2.png",
                    "expl": "Diaphgram Size: Large Diaphragm = Big, warm vocal sound. Small Diaphragm = Accurate, fast cymbal/acoustic guitar sound."
                },
                "7": {
                    "img": "/images/svg/proximity_graph.svg",
                    "expl": "Pop Shield: A nylon mesh placed before the mic. It breaks up the air blast from 'P' and 'B' sounds (plosives) that would otherwise thump the recording."
                },
                "8": {
                    "img": "/images/diagram_mics_v2.png",
                    "expl": "Cardioid Pattern: Named after 'Cardiac' (Heart). It rejects sound from the rear. This is why stage monitors are placed behind the singer's mic."
                },
                "9": {
                    "img": "/images/svg/microphone_symbols.svg",
                    "expl": "Figure-8: Bi-directional. Perfect for a duet facing each other, or specialized stereo techniques. Completely deaf to the sides (90°)."
                },
                "10": {
                    "img": "/images/diagram_mics_v2.png",
                    "expl": "Shockmount: The suspension cradle. It isolates the mic from floor vibrations. Without it, tapping your foot gets recorded as a low thump."
                }
            },
            "Intermediate": {
                "1": {
                    "img": "/images/diagram_mics_v2.png",
                    "expl": "Transient Response: The speed of the diaphragm. SDC (Small Diaphragm) mics move faster, capturing the sharp attack of percussion better than heavy Dynamic mics."
                },
                "2": {
                    "img": "/images/svg/proximity_graph.svg",
                    "expl": "Off-Axis Coloration: Sound entering the side of a cheap mic often sounds muddy. Good mics maintain their tone even when the singer moves off-center."
                },
                "3": {
                    "img": "/images/diagram_mics_v2.png",
                    "expl": "Electret Condenser: A permanently charged capacitor. Common in lavalier mics. Modern electrets are pro quality, unlike the cheap ones of the past."
                },
                "4": {
                    "img": "/images/svg/microphone_symbols.svg",
                    "expl": "Multi-Pattern Mics: Mics with dual diaphragms can vary their voltage sum/difference to electrically create Omni, Cardioid, or Fig-8 patterns on the fly."
                },
                "5": {
                    "img": "/images/diagram_mics_v2.png",
                    "expl": "Pad Switch (-10dB): A switch on the mic that lowers sensitivity. Use it when recording ultra-loud sources (like a snare drum) to prevent internal circuit clipping."
                },
                "6": {
                    "img": "/images/diagram_mics_v2.png",
                    "expl": "Sensitivity Rating: Measured in mV/Pa. Condensers produce high voltage (loud). Ribbons produce tiny voltage (quiet), requiring high-gain preamps."
                },
                "7": {
                    "img": "/images/svg/microphone_symbols.svg",
                    "expl": "Hyper-Cardioid: Tighter focus than Cardioid, but has a rear lobe of sensitivity. Requires precise monitor placement to avoid feedback (at 120°, not 180°!)."
                },
                "8": {
                    "img": "/images/diagram_mics_v2.png",
                    "expl": "Self-Noise (EIN): The noise a mic makes just by being on. 15dBA is average. 7dBA is ultra-quiet. Important for classical recording."
                },
                "9": {
                    "img": "/images/svg/transducer_diagram.svg",
                    "expl": "Induction Principle: Dynamic mics work like a speaker in reverse—a coil moving in a magnetic field generates current. Simple, passive, robust."
                },
                "10": {
                    "img": "/images/diagram_mics_v2.png",
                    "expl": "Boundary / PZM Mic: Mounts to a flat surface (wall/floor). Uses the 'Pressure Zone' to eliminate phase reflections, capturing clear room tone."
                }
            }
        },
        "Subject 7": {
            "Basic": {
                "1": {
                    "img": "/images/svg/stereo_field.svg",
                    "expl": "Stereo Image: The phantom stage. By panning L and R, we create a virtual space. A good mix feels 3D, not just a bunch of mono sounds."
                },
                "2": {
                    "img": "/images/svg/3_to_1_rule_diagram.svg",
                    "expl": "3:1 Rule: When using two mics (like snare top and hi-hat), keep them 3x apart (relative to source distance) to minimize phasing issues."
                },
                "3": {
                    "img": "/images/svg/stereo_field.svg",
                    "expl": "XY Pair (Coincident): Two Cardioid mics at 90° with capsules touching. Very focused, phase-perfect stereo. Great for drum overheads."
                },
                "4": {
                    "img": "/images/svg/stereo_field.svg",
                    "expl": "Spaced Pair (AB): Two mics placed far apart (e.g., 3 feet). Captures a huge, wide time-delay stereo image, but riskier for mono compatibility."
                },
                "5": {
                    "img": "/images/diagram_mid_side_v2.png",
                    "expl": "Mid-Side (M/S): One Cardioid (Mid) + One Figure-8 (Side). Allows you to control the WIDTH of the recording after you've captured it. Magic."
                },
                "6": {
                    "img": "/images/svg/phase_cancellation.svg",
                    "expl": "Mono Check: Always press the MONO button. If your huge guitar sound disappears, you have phase cancellation. Listeners on phones/radios will hear silence."
                },
                "7": {
                    "img": "/images/svg/stereo_field.svg",
                    "expl": "Panning Laws: The Pan knob. Don't be afraid to go Hard Left/Right. Width comes from contrast—things in the middle vs things on the edge."
                },
                "8": {
                    "img": "/images/diagram_mid_side_v2.png",
                    "expl": "Decca Tree: 3 Omni mics in a T-shape. Invented by Decca Records. It's the sound of every John Williams film score (Star Wars, etc)."
                },
                "9": {
                    "img": "/images/svg/stereo_field.svg",
                    "expl": "Phantom Center: When L and R play the exact same signal, our brain places the sound dead center (where the Vocal usually sits)."
                },
                "10": {
                    "img": "/images/svg/stereo_field.svg",
                    "expl": "Binaural: Uses a dummy head with mics in the ears. Listened via headphones, it's startlingly real—you can hear sounds 'behind' or 'above' you."
                }
            },
            "Intermediate": {
                "1": {
                    "img": "/images/svg/stereo_field.svg",
                    "expl": "ORTF: French broadcast standard. Cardioid mics spaced 17cm (ear width) at 110°. Captures accurate localization and nice room ambience."
                },
                "2": {
                    "img": "/images/diagram_mid_side_v2.png",
                    "expl": "M/S Decoding: (Mid + Side) = Left. (Mid - Side) = Right. You need a plugin or mixer math to decode this matrix to hear stereo."
                },
                "3": {
                    "img": "/images/svg/stereo_field.svg",
                    "expl": "Blumlein Pair: Two Figure-8 mics crossed at 90°. Captures 360° of the room. Requires a beautiful sounding room because it hears the ceiling and floor too."
                },
                "4": {
                    "img": "/images/svg/phase_cancellation.svg",
                    "expl": "Stereo Theory: XY relies on Level differences (Intensity Stereo). AB relies on Timing differences (Time-of-Arrival Stereo). Time stereo feels 'bigger' but looser."
                },
                "5": {
                    "img": "/images/svg/stereo_field.svg",
                    "expl": "Haas Effect: Delays <30ms are fused by the brain. If the Left side arrives 10ms first, the brain perceives the source as being on the Left."
                },
                "6": {
                    "img": "/images/svg/stereo_field.svg",
                    "expl": "LCR Mixing: Left-Center-Right only. No 50% panning. Forces strong arrangement choices. The secret to massive, uncluttered rock mixes."
                },
                "7": {
                    "img": "/images/svg/3_to_1_rule_diagram.svg",
                    "expl": "Bleed Management: Using microphone null points (the deaf spot) to reject unwanted instruments. Point the snare mic's null at the hi-hat."
                },
                "8": {
                    "img": "/images/diagram_mid_side_v2.png",
                    "expl": "Side Channel EQ: Shaping the M/S signal. Boosting treble on the SIDE channel makes a mix feel wider and more expansive without muddying the center vocals."
                },
                "9": {
                    "img": "/images/svg/stereo_field.svg",
                    "expl": "Correlation: +1 = Mono. 0 = Stereo wide. -1 = 180° Phase issues. Keep your mix correlation positive to ensure it translates."
                },
                "10": {
                    "img": "/images/svg/stereo_field.svg",
                    "expl": "Jecklin Disc: An acoustic baffle used with spaced omnis (AB) to simulate head-shadowing. Improves the stereo imaging of an AB pair."
                }
            }
        },
        "Subject 8": {
            "Basic": {
                "1": {
                    "img": "/images/svg/midi_piano_roll.svg",
                    "expl": "Pre-production: The 'Ghost' Phase. Fixing the song BEFORE you hit record. Tempo maps, rehearsing, key changes. A saved hour here saves days later."
                },
                "2": {
                    "img": "/images/svg/sample_rate_dots.svg",
                    "expl": "Click Track: The Metronome. Love it or hate it, it's essential for editing/copy-pasting later. Modern pop/EDM is 100% grid-locked."
                },
                "3": {
                    "img": "/images/svg/midi_piano_roll.svg",
                    "expl": "Tempo Mapping: If a band wants to slow down for the chorus, we program the click track to slow down with them. The grid 'breathes' with the music."
                },
                "4": {
                    "img": "/images/svg/waveform_time_domain.svg",
                    "expl": "Take Management: Don't keep 50 takes. Record 3 good ones, then Stop. Decision paralysis kills creativity. Label them 'Good', 'Better', 'Best'."
                },
                "5": {
                    "img": "/images/svg/waveform_time_domain.svg",
                    "expl": "Comping (Composite): building the 'Super-Take'. Taking the verse from Take 1 and the Chorus from Take 3 to create a flawless performance."
                },
                "6": {
                    "img": "/images/svg/waveform_time_domain.svg",
                    "expl": "Punch-In: The 'Fix-It' mode. The band plays along, and the engineer hits record only for the one bad note, fixing it seamlessly."
                },
                "7": {
                    "img": "/images/svg/frequency_spectrum_treble.svg",
                    "expl": "Reference Tracks: Pro Comparison. Listening to a pro mix (like Dr. Dre or Pink Floyd) while you work to reset your ears and check your bass levels."
                },
                "8": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Sound Check: The Calibration. Getting the mics placed and levels set before the talent gets tired. Capture the best performance, not the warmup."
                },
                "9": {
                    "img": "/images/diagram_file_size_math_v2.png",
                    "expl": "Backups: Current Rule: 3 copies. 1 on computer, 1 on external drive, 1 in the cloud. Hard drives fail. It's not 'if', but 'when'."
                },
                "10": {
                    "img": "/images/svg/headroom_diagram.svg",
                    "expl": "Ear Fatigue: After 4 hours, your ears lie to you. You start boosting treble because your hearing is tired. Take breaks to stay objective."
                }
            },
            "Intermediate": {
                "1": {
                    "img": "/images/svg/waveform_time_domain.svg",
                    "expl": "Playlist/Lane Comping: Modern DAW feature. Viewing all takes stacked vertically to slice/dice the perfect vocal line intuitively."
                },
                "2": {
                    "img": "/images/diagram_latency_buffer_v2.png",
                    "expl": "Cue Mix / Foldback: The Headphone Mix. The single most important factor for a singer's pitch. If they can't hear themselves well, they will sing sharp/flat."
                },
                "3": {
                    "img": "/images/diagram_file_size_math_v2.png",
                    "expl": "File Naming: 'Song_Final_Final_REAL_v2.wav' is a disaster. Use 'Song_Mix_v1.0_Date'. Be professional with your assets."
                },
                "4": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Documentation: Track Sheets. Writing down which mic and preamp was used on the kick drum. 6 months later when you need to re-record, you'll thank yourself."
                },
                "5": {
                    "img": "/images/svg/waveform_time_domain.svg",
                    "expl": "Crossfades: Every edit point needs a tiny crossfade (10ms). Without it, the waveform jump creates a digital 'click' sound."
                },
                "6": {
                    "img": "/images/diagram_latency_buffer_v2.png",
                    "expl": "Latentcy Free Monitoring: Giving the artist the analog signal before it hits the computer. Vital for rappers/drummers where timing is everything."
                },
                "7": {
                    "img": "/images/diagram_file_size_math_v2.png",
                    "expl": "Stem Export: Printing groups (Drums, Vocals, Music) separately. Essential for remixes, sync licensing (TV requires Instrumental versions), and future-proofing."
                },
                "8": {
                    "img": "/images/svg/midi_piano_roll.svg",
                    "expl": "Commit / Freeze: Rendering MIDI synths to Audio. Saves CPU, but more importantly, it 'locks' the sound so it plays back identically 10 years from now."
                },
                "9": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Talkback Mic: The communication line. Being able to talk to the artist in the booth smoothly keeps the 'Vibe' alive. Silence is awkward."
                },
                "10": {
                    "img": "/images/diagram_file_size_math_v2.png",
                    "expl": "Version Control: Start a 'Save As' for every major mix revision. Never overwrite today's work with tomorrow's mistakes."
                }
            }
        },
        "Subject 9": {
            "Basic": {
                "1": {
                    "img": "/images/diagram_nyquist_v2.png",
                    "expl": "A/D Converter: The Gatekeeper. Turns heavy analog voltage into lightweight digital code (1s and 0s). The quality of this chip defines your clarity."
                },
                "2": {
                    "img": "/images/diagram_latency_buffer_v2.png",
                    "expl": "Latency: The Lag. Audio goes In -> CPU -> Out. This trip takes time (ms). If it's too slow, it feels like an echo when performing."
                },
                "3": {
                    "img": "/images/diagram_spdif_connectors_v2.png",
                    "expl": "I/O (Inputs/Outputs): How many things can you record at once? 2 I/O is a singer-songwriter. 24 I/O is a full live rock band."
                },
                "4": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Driver: The Translator software. It tells Windows/Mac how to talk to the interface hardware. A bad driver causes crashes and crackles."
                },
                "5": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Bus Power: Running the interface off the USB cable power. Convenient for laptops, but can sometimes lack the 'juice' for 48V phantom power on many mics."
                },
                "6": {
                    "img": "/images/diagram_spdif_connectors_v2.png",
                    "expl": "Sample Rate Selection: Setting the speed limit (44.1k vs 96k). Higher gives more frequency range but makes files 2x bigger."
                },
                "7": {
                    "img": "/images/diagram_di_box_flow_v2.png",
                    "expl": "Combo Jack: The clever socket that accepts both XLR (Mic) and 1/4 inch (Line/Inst) cables in the same hole. Saves space."
                },
                "8": {
                    "img": "/images/svg/snr_concept.svg",
                    "expl": "Preamp Gain: The loudness knob on the interface. Cheap interfaces have noisy gain. Expensive ones have 'clean' gain."
                },
                "9": {
                    "img": "/images/diagram_latency_buffer_v2.png",
                    "expl": "Buffer Size: The Safety Tank. Low buffer (64) = Low Latency (Fast). High buffer (1024) = High Stability (Safe from clicking/popping)."
                },
                "10": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "DSP (Digital Signal Processing): Some interfaces have chips inside to run EQ/Reverb on the input without using the computer's CPU."
                }
            },
            "Intermediate": {
                "1": {
                    "img": "/images/diagram_jitter_clock_v2.png",
                    "expl": "Jitter Specs: Measured in picoseconds. Lower is better. Good clocking keeps the stereo image solid and depth perception clear."
                },
                "2": {
                    "img": "/images/diagram_spdif_connectors_v2.png",
                    "expl": "Aggregate Device: Mac trick. Combining two different interfaces to look like one big interface to the DAW. Useful but adds latency."
                },
                "3": {
                    "img": "/images/diagram_aliasing_v2.png",
                    "expl": "Converter Linearity: Does 1dB in equal 1dB out at all levels? Cheap converters get inaccurate at very low volumes."
                },
                "4": {
                    "img": "/images/diagram_spdif_connectors_v2.png",
                    "expl": "Word Clock Termination: 75-ohm. Vital when syncing multiple digital racks. Without termination, the clock signal bounces back and causes errors."
                },
                "5": {
                    "img": "/images/diagram_spdif_connectors_v2.png",
                    "expl": "Thunderbolt vs USB: Thunderbolt is PCIe (direct to CPU), offering insanely low latency. USB is a packet-based bus, slightly slower overhead."
                },
                "6": {
                    "img": "/images/svg/snr_concept.svg",
                    "expl": "Dynamic Range Spec: A pro interface typically offers 120dB+ input dynamic range. A consumer one might be 100dB (noier)."
                },
                "7": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Loopback: A feature letting you record the computer's own audio output. Essential for podcasters who want to record a Skype guest."
                },
                "8": {
                    "img": "/images/diagram_di_box_flow_v2.png",
                    "expl": "Class-A Preamps: Discrete, high-voltage circuitry. Sounds huge and warm compared to the generic Integrated Circuit (IC) chips in cheap gear."
                },
                "9": {
                    "img": "/images/diagram_spdif_connectors_v2.png",
                    "expl": "MADI / Dante: Network audio protocols. Carrying hundreds of channels over an Ethernet cable. The standard for stadiums and broadcast."
                },
                "10": {
                    "img": "/images/diagram_latency_buffer_v2.png",
                    "expl": "Round-Trip Latency (RTL): The only number that matters. <5ms is imperceptible. >10ms feels 'sluggish' for a drummer."
                }
            }
        },
        "Subject 10": {
            "Basic": {
                "1": {
                    "img": "/images/svg/stereo_field.svg",
                    "expl": "Nearfield Monitors: Designed to be listened to close up (3-5 feet). This minimizes the sound of the room reflections, giving you the direct truth."
                },
                "2": {
                    "img": "/images/svg/equipment_cable_types_connector_guide.svg",
                    "expl": "Check your cables: A bad cable can crackle or lose bass. It's the cheapest but most common point of failure in a studio."
                },
                "3": {
                    "img": "/images/svg/stereo_field.svg",
                    "expl": "Sweet Spot: The apex of the triangle. You and the two speakers should form an equilateral triangle (60 degrees) for perfect stereo imaging."
                },
                "4": {
                    "img": "/images/svg/frequency_spectrum_bass.svg",
                    "expl": "Active Monitors: Speakers with amps built inside. Matched perfectly by the factory. Passive speakers need an external amp."
                },
                "5": {
                    "img": "/images/svg/equipment_cable_types_connector_guide.svg",
                    "expl": "TRS Cable: Tip-Ring-Sleeve. Looks like a headphone jack but carries balanced mono audio to your speakers."
                },
                "6": {
                    "img": "/images/svg/frequency_spectrum_bass.svg",
                    "expl": "Subwoofer: Handles the bottom octave (20-80Hz). Tricky to set up. If it's too loud, you will mix your track with thin bass."
                },
                "7": {
                    "img": "/images/svg/stereo_field.svg",
                    "expl": "Room Treatment: Placing foam/fiberglass on walls. Crucial. The best speakers in a tiled bathroom will sound terrible."
                },
                "8": {
                    "img": "/images/svg/equipment_cable_types_connector_guide.svg",
                    "expl": "RCA Cable: The red/white Hi-Fi cable. Unbalanced. Fine for short runs to a CD player, bad for long studio runs."
                },
                "9": {
                    "img": "/images/svg/stereo_field.svg",
                    "expl": "Isolation Pads: Foam under the speakers. Stops the desk from vibrating. Tightens up the bass response."
                },
                "10": {
                    "img": "/images/svg/equipment_cable_types_connector_guide.svg",
                    "expl": "Soldering: The art of fixing your own cables. A vital skill that saves you money and session downtime."
                }
            },
            "Intermediate": {
                "1": {
                    "img": "/images/svg/frequency_spectrum_bass.svg",
                    "expl": "Ported vs Sealed: Ported speakers (hole in front/back) have more bass but looser time response. Sealed speakers have tight transients but less bass extension."
                },
                "2": {
                    "img": "/images/svg/stereo_field.svg",
                    "expl": "Room Modes: Standing waves where bass frequencies build up or cancel out in a room. Bass Traps in corners are the only fix."
                },
                "3": {
                    "img": "/images/svg/equipment_cable_types_connector_guide.svg",
                    "expl": "Cable Capacitance: Long cables act as a capacitor (filter), rolling off high frequencies. This is why guitar cables shouldn't be 50 feet long."
                },
                "4": {
                    "img": "/images/svg/stereo_field.svg",
                    "expl": "Diffusers: Scatter sound instead of absorbing it. Keeps the room sounding 'alive' and big without slapback echoes."
                },
                "5": {
                    "img": "/images/svg/frequency_spectrum_bass.svg",
                    "expl": "Crossover: The circuit splitting highs to the Tweeter and lows to the Woofer. A good crossover creates a seamless transition in the mids."
                },
                "6": {
                    "img": "/images/svg/equipment_cable_types_connector_guide.svg",
                    "expl": "Star Grounding: A wiring scheme where all grounds meet at a single point to eliminate hum loops in complex racks."
                },
                "7": {
                    "img": "/images/svg/stereo_field.svg",
                    "expl": "Sonarworks / Room Correction: Software that EQs your speakers to counteract the flaws of your room. A useful band-aid, but physics (treatment) is better."
                },
                "8": {
                    "img": "/images/svg/equipment_cable_types_connector_guide.svg",
                    "expl": "Oxygen Free Copper (OFC): Purer copper in cables. Audiophiles argue it sounds better. In reality, mechanical durability is more important for pros."
                },
                "9": {
                    "img": "/images/svg/frequency_spectrum_treble.svg",
                    "expl": "Ribbon Tweeters: Use a folded metal ribbon instead of a dome. Ultra-fast transient response and very smooth high end (non-fatiguing)."
                },
                "10": {
                    "img": "/images/svg/equipment_cable_types_connector_guide.svg",
                    "expl": "Speakon Connector: The standard for live PA speakers. Twist-lock, impossible to short out, handles huge current."
                }
            }
        },
        "Subject 11": {
            "Basic": {
                "1": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Channel Strip: The vertical slice of a mixer. Preamp -> EQ -> Aux -> Fader. It's the building block of the console."
                },
                "2": {
                    "img": "/images/svg/snr_concept.svg",
                    "expl": "Fader: The Volume Slider. It's logarithmic, giving you fine control near the top (Unity) and coarse control near the bottom."
                },
                "3": {
                    "img": "/images/svg/stereo_field.svg",
                    "expl": "Pan Pot: Panoramic Potentiometer. Moves sound Left or Right. Using it creates the stereo stage."
                },
                "4": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Mute / Solo: Mute kills the channel. Solo kills everyone else. Use Solo to check for noise; use Mute to arrange the song."
                },
                "5": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Aux Send: 'Auxiliary' (Helper). Splits the signal to send to a Reverb unit or Headphone amp. The main fader doesn't change, but the Aux does."
                },
                "6": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Bus / Group: Routing multiple channels (Kick, Snare, Hats) to one Fader (Drum Bus). Allows you to turn down the whole kit with one finger."
                },
                "7": {
                    "img": "/images/diagram_di_box_flow_v2.png",
                    "expl": "Insert: A hijack point. You prefer to insert dynamics (Comp/Gate) here so they affect the signal fully before the fader."
                },
                "8": {
                    "img": "/images/svg/snr_concept.svg",
                    "expl": "Master Fader: The Final Output. This controls the level going to the print. NEVER let this clip."
                },
                "9": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Pre/Post Switch: Determines if the Aux Send happens before the Fader (Headphones) or after (Reverb). Essential knowledge."
                },
                "10": {
                    "img": "/images/diagram_di_box_flow_v2.png",
                    "expl": "Trim/Gain: The very top knob. Sets the sensitivity. This is the water pressure entering the pipe; the fader is the tap at the end."
                }
            },
            "Intermediate": {
                "1": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "VCA Fader: Voltage Controlled Amplifier. A remote control fader. It changes the volume of other faders without audio actually passing through it."
                },
                "2": {
                    "img": "/images/svg/stereo_field.svg",
                    "expl": "Pan Law: Does the sound get louder when you pan center? A -3dB Pan Law dips the volume in the center to maintain perceived constant loudness."
                },
                "3": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Matrix Mix: A mixer within a mixer. Taking the Group Outputs (Drums, Vocals) and creating alternate mixes (Livestream, Foyer, Record)."
                },
                "4": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Direct Out: Taking the clean signal right after the preamp, bypassing the rest of the console. Used for recording live shows to a multitrack."
                },
                "5": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Solo Safe: A mode that prevents a channel (like an FX Return) from being muted when you solo another channel. Keeps the reverb heard."
                },
                "6": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Inline Console: A complex desk where the Input path (Mic) and Monitor path (Tape Return) share the SAME channel strip. Confusion for beginners."
                },
                "7": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Flip Button: Swapping the small fader and large fader on an inline console. Commonly used to mix with the big faders."
                },
                "8": {
                    "img": "/images/svg/snr_concept.svg",
                    "expl": "Unity Gain Architecture: Setting every fader to 0 and adjusting input gains so the mix is balanced 'flat'. A good starting point for clarity."
                },
                "9": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Automation Mode: Read, Write, Touch, Latch. 'Latch' stays where you leave it. 'Touch' snaps back when you let go. Critical for mixing."
                },
                "10": {
                    "img": "/images/svg/signal_chain_basic.svg",
                    "expl": "Talkback Dim: When you press the Talkback button, the control room speakers automatically dim (-20dB) to prevent feedback loops."
                }
            }
        },
        "Subject 12": {
            "Basic": {
                "1": {
                    "img": "/images/diagram_clipping_v2.png",
                    "expl": "Clipping Risk: Digital clipping is unforgiving. It sounds like static. Unlike analog tape, there is no 'good' digital distortion."
                },
                "2": {
                    "img": "/images/svg/headroom_diagram.svg",
                    "expl": "Headroom: Think of it as 'ceiling height'. You don't build a house with a 6ft ceiling; you build 9ft so you can jump without hitting your head."
                },
                "3": {
                    "img": "/images/svg/snr_concept.svg",
                    "expl": "Yellow is Good: In modern digital meters, green is quiet, yellow is healthy (-18 to -6), and red is dangerous. Stay in the yellow."
                },
                "4": {
                    "img": "/images/diagram_clipping_v2.png",
                    "expl": "Soft Clip: A feature on some limiters that rounds off the corners of the wave instead of chopping them flat. Sounds warmer and less harsh."
                },
                "5": {
                    "img": "/images/svg/headroom_diagram.svg",
                    "expl": "Master Bus Creep: You push the drum fader, then the bass, then the vocal. Suddenly the master is clipping. Turn everything DOWN instead."
                },
                "6": {
                    "img": "/images/diagram_clipping_v2.png",
                    "expl": "Visual Waveform: If your recorded waveform looks like a solid block with flat tops, it is clipped. You cannot fix this. Re-record it."
                },
                "7": {
                    "img": "/images/svg/snr_concept.svg",
                    "expl": "Bit Depth Safety: 24-bit recording gives you a massive noise floor safety net. You can record quietly to avoid clipping and turn it up later safely."
                },
                "8": {
                    "img": "/images/diagram_clipping_v2.png",
                    "expl": "Limiter on Output: A safety belt. Always have a limiter set to -0.1dB on your output when bouncing files to ensure no stray peaks ruin the file."
                },
                "9": {
                    "img": "/images/svg/snr_concept.svg",
                    "expl": "Gain Staging Rules: Don't boost EQ by +12dB. That eats headroom. Cut the frequencies you don't want instead."
                },
                "10": {
                    "img": "/images/diagram_fletcher_munson_v2.png",
                    "expl": "Perceived Loudness: Don't clip the master to make it loud. Use compression and saturation to increase density/RMS level instead."
                }
            },
            "Intermediate": {
                "1": {
                    "img": "/images/diagram_clipping_v2.png",
                    "expl": "Intersample Peaks: The hidden clip. Digital samples might be below 0dB, but the analog curve between them arcs over. True Peak meters reveal this."
                },
                "2": {
                    "img": "/images/svg/headroom_diagram.svg",
                    "expl": "Floating Point: 32-bit float allows values above 0dBFS internally. You can recover a clipped channel by just turning the fader down. Magic."
                },
                "3": {
                    "img": "/images/svg/dbfs_meter.svg",
                    "expl": "Loudness War: The historic trend of crushing dynamic range to -6 LUFS. Luckily, streaming normalization (Spotify -14 LUFS) has ended this."
                },
                "4": {
                    "img": "/images/diagram_clipping_v2.png",
                    "expl": "Brickwall vs Clipping: A limiter cleanly reduces gain. A clipper intentionally chops the wave. Some mastering engineers use clippers for 'transparent' loudness."
                },
                "5": {
                    "img": "/images/svg/snr_concept.svg",
                    "expl": "Crest Factor: The difference between Peak and RMS. A high crest factor sound (snare) needs headroom. A low crest factor sound (distorted bass) does not."
                },
                "6": {
                    "img": "/images/svg/headroom_diagram.svg",
                    "expl": "D/A Converter Overload: Even if the file isn't clipped, a signal hitting 0dBFS can overload the analog circuitry of a cheap DAC. Leave -1dB margin."
                },
                "7": {
                    "img": "/images/diagram_clipping_v2.png",
                    "expl": "Digital Overs: A 'Clip' isn't just one sample. Most meters light up after 3 consecutive samples at 0dBFS. That's an audible glitch."
                },
                "8": {
                    "img": "/images/svg/snr_concept.svg",
                    "expl": "Gain Interdependence: EQ affects headroom. A Low Cut filter can actually INCREASE peak levels due to phase shift! Watch your meters."
                },
                "9": {
                    "img": "/images/diagram_clipping_v2.png",
                    "expl": "Restoration: Tools like iZotope RX can 'de-clip' by mathematically guessing what the waveform looked like. It works surprisingly well on mild clips."
                },
                "10": {
                    "img": "/images/svg/dbfs_meter.svg",
                    "expl": "Delivery Specs: Broadcast TV has strict limits (e.g., -23 LUFS, -1dBTP). Failing these automated checks means your mix gets rejected instantly."
                }
            }
        }
    }
}